In [29]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

import pandas as pd

In [30]:
data = [4,8,15,16,23,42]

pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [31]:
# Q2. Create a variable of list type containing 10 elements in it, 
# and apply pandas.Series function on the variable print it.

my_list = [1,2,3,4,5,6,7,8,9,10]

pd.Series(my_list)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [32]:
# Q3. Create a Pandas DataFrame that contains the following data:

pd.DataFrame({'Name': ['Alice', 'Bob', 'Claire'],
              'Age' : [ 25,30,27],
              'Gender': ['Female', 'Male', 'Female']})

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [33]:
# Q4. What is ‘DataFrame’ in pandas and how 
# is it different from pandas.series? Explain with an example.

#### DataFrame in Pandas:

A DataFrame is a two-dimensional, tabular data structure in Pandas.
It is similar to a spreadsheet or a SQL table.
It consists of rows and columns, where each column can be of a different data type.
It can be thought of as a collection of Series where each Series represents a column.
Pandas Series:

A Series is a one-dimensional labeled array in Pandas.
It can hold any data type and is essentially a single column of a DataFrame.
It is labeled, meaning each element has an index associated with it.
Example:

In [34]:
s = pd.Series([1, 2, 3, 4], name = 'Number')

In [35]:
df = pd.DataFrame(s)
df

   Number
0       1
1       2
2       3
3       4

In [36]:
# Q5. What are some common functions you can use to manipulate 
# data in a Pandas DataFrame? Can you give an example of when 
# you might use one of these functions?

In [37]:
# Display the first 3 rows 
df.head(2)

   Number
0       1
1       2

In [38]:
# Get summay statistics
df.describe()

         Number
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [39]:
# Get the dimension 
df.shape

(4, 1)

In [40]:
# Display information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Number  4 non-null      int64
dtypes: int64(1)
memory usage: 164.0 bytes

In [41]:
# Sort the DataFrame by 'Number' in ascending order
df.sort_values(by='Number', ascending=True)

   Number
0       1
1       2
2       3
3       4

In [42]:
# Group by 'Number' and calculate the mean age
df.groupby('Number').mean()

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4]

In [43]:
# Drop the 'Number' column
df_dropped = df.drop('Number', axis=1)
df_dropped

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [48]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

##### Series: Mutable - You can modify the values, add or remove elements, and perform various operations on a Series.

DataFrame: Mutable - You can modify the values, add or remove columns, and perform various operations on a DataFrame.

Panel: Deprecated - The Panel data structure was deprecated in Pandas version 0.25.0, and users are encouraged to use multi-index DataFrames or 3D NumPy arrays instead. Therefore, Panel is not considered a current and supported part of Pandas.

In [45]:
#Q7.  Create a DataFrame using multiple Series. Explain with an example.

In [47]:
# Creating Series for 'Name', 'Age', and 'Gender'
names = pd.Series(['Alice', 'Bob', 'Claire'], name='Name')
ages = pd.Series([25, 30, 27], name='Age')
genders = pd.Series(['Female', 'Male', 'Female'], name='Gender')

# Creating a DataFrame using the Series
df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female